Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: Enjoy the little things, for one day you may look back and realize they were the big things.
hi: छोटी छोटी बातों का आनंद उठाइए, क्योंकि हो सकता है कि किसी दिन आप मुड़ कर देखें तो आप को अनुभव हो कि ये तो बड़ी बातें थीं।

source: The absence of alternatives clears the mind marvelously.
hi: विकल्पों का न होना बुद्धि को बढ़िया ढंग से परिमार्जित कर देता है।

source: The one thing that doesn't abide by majority rule is a person's conscience.
hi: एक ही चीज़ है जो बहुमत को नहीं मानती और वह है मनुष्य की अंतरात्मा।

source: Change your thoughts and you change your world.
hi: आप अपनी सोच बदल दीजिए, आपकी दुनिया बदल जाएगी।

source: One thought driven home is better than three left on base.
hi: एक क्रियान्वित विचार तीन अधूरे विचारों से कहीं बेहतर है।

source: The old law about 'an eye for an eye' leaves everybody blind.
hi: 'आँख के बदले आँख' के प्राचीन सिद्धान्त से तो एक दिन सभी अंधे हो जाएंगे।

source: Goals determine what you are going to be.
hi: हमारे लक्ष्य निर्धारित करते हैं कि हम क्या बनने जा रहे हैं।

source: Storms make trees take deeper roots.
hi: तूफ़ानों से पेड़ों की जड़ें और गहरी व मज़बूत होती है।

source: Nothing happens unless it is preceded by a dream.
hi: कोई सपना देखे बिना कुछ नहीं होता।

source: A heron, a crab, lots of fish and other creatures used to live in a pond.
hi: एक तालाब में एक बगुला, एक केकड़ा, बहुत से मछली और दूसरे जीव-जंतु रहते थे।

source: The heron had to hunt for food every day.
hi: बगुले को हर दिन भोजन के लिए शिकार करना पड़ता था।

source: A tomb now suffices him for whom the whole world was not sufficient.
hi: जिसके लिये पूरी दुनिया कम पड़ती थी उसके लिये एक समाधि भी अब पर्याप्त है।

source: Truth alone triumphs.
hi: सत्य ही जीतता है।

source: In some languages like French or Persian, a potato is called an 'apple of the earth'.
hi: फ़्रेंच या फ़ारसी जैसे कुछ भाषाओं में, आलू को 'ज़मीन का सेब' कहते है।

source: I drink the water.
hi: मैं पानी पीता हूँ।

source: The girl talking with John is called Susan.
hi: जॉन से जो लड़की बात कर रही है उसका नाम सूज़न है।

source: Tom solved the problem easily.
hi: टॉम ने आसानी से वह समस्या सुलझाई।

source: Faith, unity, discipline.
hi: ईमान, इत्तेहाद, नज़्म।

source: Mother and motherland are greater than heaven.
hi: जननी-जन्मभूमी स्वर्ग से महान हैं।

source: Where are the soldiers?
hi: सैनिक कहाँ हैं?

source: She looks like a Greek goddess.
hi: वह किसी युनानी देवी की तरह दिखती है।

source: The meaning of the word "sex" is often unclear.
hi: "सेक्स" शब्द का मतलब अक्सर अस्पष्ट होता है।

source: He tried to kiss me.
hi: उसने मुझे चूमने की कोशिश की।

source: Would you like to ask me something else?
hi: क्या आप मुझसे और कुछ पूछना चाहेंगे?

source: My country is far from Japan.
hi: मेरा देश जापान से दूर है।

source: Someone will see us!
hi: कोई हमें देख लेगा!

source: Zaragoza is a Spanish town.
hi: ज़ारागोज़ा एक स्पेनी नगर है।

source: The airplane is ready.
hi: हवाई जहाज़ तैयार है।

source: St. Petersburg is a Russian city.
hi: सेंट पीटर्सबर्ग एक रूसी नगर है।

source: One kiss or two?
hi: एक चुम्मा या दो?

source: "What's the capital of Sri Lanka?" "Sri Jayawardenapura Kotte." "Correct!"
hi: "श्रीलंका की राजधानी क्या है?" "श्री जयवरधनेपुरा कोट।" "सही!"

source: He is a singer.
hi: वह गायक है।

source: My horse is black.
hi: मेरा घोड़ा काला है।

source: I like to dance.
hi: मुझे नाचना पसंद है।

source: My name is Francesco.
hi: मेरा नाम फ़्रांचेस्को है।

source: She fell in love with one of her students.
hi: उसे अपने एक विद्यार्थी से प्यार हो गया।

source: My name is Roberto.
hi: मेरा नाम रोबेर्टो है।

source: She's coming with us.
hi: वह हमारे साथ आ रही है।

source: Tom took off his cap.
hi: टॉम ने अपनी टोपी उतारी।

source: My native language is Portuguese.
hi: मेरी मातृ भाषा पुर्त्तगाली है।

source: I'm not that stupid.
hi: मैं उतना बेवकूफ़ नहीं हूँ।

source: I am going back to India.
hi: मैं भारत लौट रहा हूँ।

source: They all look the same to me.
hi: मुझे तो वे सब एक जैसे लगते हैं।

source: They're both older than you.
hi: वे दोनों तुमसे उम्र में बड़े हैं।

source: We're in the same class.
hi: हम दोनों एक ही कक्षा में हैं।

source: They're all hungry.
hi: वे सब भूखे हैं।

source: I can't lie to Tom.
hi: मैं टॉम से झूठ नहीं बोल सकता।

source: They're all alike.
hi: वे सभी एक जैसे हैं।

source: You should've said yes.
hi: तुम्हें "हाँ" कहना चाहिए था।

source: My father went to China.
hi: मेरे पिता चीन गये।

source: The king rules over the country.
hi: राजा देश पर राज करता है।

source: Mordred betrayed King Arthur.
hi: मॉर्ड्रेड ने राजा आर्थर को धोका दिया।

source: We are just friends.
hi: हम बस दोस्त हैं।

source: You know what they say: long nose, long cock.
hi: कहावत तो तुमने सुनी ही होगी: लंबा नाक, लंबा लंड।

source: France, Austria and Russia formed an alliance against Prussia.
hi: फ़्रांस, ऑस्ट्रिया और रूस ने प्रुशिया के ख़िलाफ़ एक गठबंधन बनाया।

source: Hey boys, what's up?
hi: और लड़कों, क्या हाल चल रहा है?

source: I named my dog Rex.
hi: मैंने मेरे कुत्ते का नाम "रेक्स" रखा।

source: I want a new knife.
hi: मुझे एक नयी छुरी चाहिए।

source: The pencil is black.
hi: पेन्सिल काली है।

source: What about Tom?
hi: टॉम का क्या?

source: The name of João's sister is Joana.
hi: जुआओं के बहन का नाम जोआना है।

source: I make a lot more money than he does.
hi: मैं उससे बहुत ज़्यादा कमाता हूँ।

source: It is a big responsibility.
hi: बड़ी ज़िम्मेदारी है।

source: Write!
hi: लिख!

source: You've started learning Esperanto.
hi: तुम ने एस्पेरान्तो सीखना शुरू किया है।

source: A mouse came into the room.
hi: कमरे में एक चूहा आया।

source: Not every citizen of Russia is Russian.
hi: रूस का हर एक नागरिक रूसी नहीं है।

source: Tom hates children.
hi: टॉम को बच्चों से नफ़रत है।

source: You made the same mistake again.
hi: तुम ने फिर से वही गलती की।

source: This skirt is long.
hi: वह स्कर्ट लंबी है|

source: Don't speak to me that way!
hi: मुझसे उस तरह से बात मत करो!

source: Out!
hi: आउट!

source: I love anal sex.
hi: मुझे गुदा मैथुन बहुत पसंद है।

source: Let us drink tea.
hi: चाय पीते हैं।

source: Skyr is similar to yoghurt.
hi: स्कीर दही की तरह होता है।

source: That's her home.
hi: वह उसका घर है।

source: That's his home.
hi: वह उसका घर है।

source: "Where is Thessaloniki?" "In Greece."
hi: "थेस्सालोनिकी कहाँ है?" "यूनान में।"

source: In Greek mythology, Hermes, the son of Zeus, is the messenger of the gods.
hi: यूनानी पुराणों में, ज़्यूस के पुत्र, हरमीस, देवताओं के दूत थे।

source: The Romans call Zeus Jupiter.
hi: रोमन ज़ेउस को जुपिटर कहते हैं।

source: I live in Indonesia.
hi: मैं इंडोनेशिया में रहता हूँ।

source: I already have this book.
hi: मेरे पास पहले से ही यह किताब है।

source: Smile.
hi: मुसकुराओ।

source: Don't ask me.
hi: मुझसे मत पूछो।

source: What time is it in Sri Lanka?
hi: श्रीलंका में कितने बजे हैं?

source: Kashgar's pomegranates are the most famous.
hi: काश्गार के अनार सबसे मशहूर हैं।

source: My grandfather is from Osaka.
hi: मेरे दादा ओसाका के हैं।

source: I drink coconut water in the morning.
hi: मैं सुबह-सुबह नारियल-पानी पीता हूँ।

source: I met him.
hi: मैं उससे मिला।

source: I'm proud to be an Italian.
hi: मुझे इतालवी होने पर गर्व है।

source: She was a little girl then.
hi: तब वह छोटी बच्ची थी।

source: There are two cows in the village.
hi: गाँव में दो गाएँ हैं।

source: What colour is this fish?
hi: यह मछली कौनसे रंग की है?

source: That's my book.
hi: वह मेरी किताब है।

source: This is the opposite of what I expected.
hi: मुझे जो अपेक्षा थी उसके यह विपरीत है।

source: Give it a try, my friends! You can do it!
hi: कोशिश कर के तो देखो, मेरे दोस्तों! आप यह कर सकते हो!

source: She didn't want to go out anyway.
hi: वह वैसे भी बाहर नहीं जाना चाहती थी।

source: I am 20 years old.
hi: मैं २० साल का हूँ।

source: What is the capital of Greece?
hi: यूनान की राजधानी क्या है?

source: You do not know me.
hi: तुम मुझे जानते नहीं।

source: He likes animals.
hi: उसे जानवर अच्छे लगते हैं।

source: I don't like using dildos, I prefer real cocks.
hi: मुझे डिल्डो इस्तेमाल करना अच्छा नहीं लगता, उससे अच्छा मुझे असली लंड पसंद हैं।

source: What a question!
hi: क्या सवाल है!

source: She is Italian.
hi: वह इतालवी है।

source: Tom is proud of his car.
hi: टॉम को अपनी गाड़ी पर गर्व है।

source: Your life is in danger.
hi: तुम्हारी जान खतरे में है।

source: Tom didn't tell Mary his real name.
hi: टॉम ने मैरी को अपना असली नाम नहीं बताया।

source: Tom broke both of his legs.
hi: टॉम ने उसकी दोनों टांगे तोड़ दी।

source: Tom wants to come with us.
hi: टॉम हमारे साथ आना चाहता है।

source: Thank you, Jesus.
hi: धन्यवाद, यीशु।

source: Jesus Christ!
hi: यीशु मसीह!

source: Jawaharlal Nehru was the first prime minister of India.
hi: जवाहरलाल नेहरू भारत के पहले प्रधान मंत्री थे।

source: Rajendra Prasad was the first president of India.
hi: राजेंद्र प्रसाद भारत के पहले राष्ट्रपति थे।

source: He's not afraid of snakes at all.
hi: वह सापोंं से बिलकुल भी नहीं डरता।

source: There is no God but Allah, and Mohammed is his prophet.
hi: अल्लाह के सिवा कोई ईश्वर नहीं है, और मुहम्मद उस का पैगंबर है।

source: During the Industrial Revolution, people worked 16 hours non-stop.
hi: औद्योगिक क्रांति के दौरान लोग बिना रुके १६ घंटे काम करते थे।

source: Why do you hide your breasts?
hi: तुम अपने स्तन क्यों छुपाती हो?

source: They're reading his book.
hi: वे उसका किताब पढ़ रहे हैं।

source: I sometimes go to the cinema.
hi: मैं कभी-कभार सिनेमा जाता हूँ।

source: The coin is gold.
hi: सिक्का सोने का है।

source: No language, no nation.
hi: भाषा नहीं तो राष्ट्र नहीं।

source: I turned 16.
hi: मैं १६ साल का हो गया।

source: They lived a couple of years in Spain.
hi: वे दो साल स्पेन में रहें।

source: He found Mary.
hi: उसे मैरी मिल गयी।

source: Where's your sword?
hi: तुम्हारी तलवार कहाँ है?

source: Sex is important to me.
hi: सेक्स मेरे लिये महत्त्वपूर्ण है।

source: Emily will stay with us.
hi: एमिली हमारे साथ रहेगी।

source: We hate insects.
hi: हमें कीड़ों से नफ़रत है।

source: Don't let it end.
hi: खत्म होने मत देना।

source: I will like it.
hi: मुझे पसंद आयेगा।

source: He is making tea.
hi: वह चाय बना रहा है।

source: Tom is making tea.
hi: टॉम चाय बना रहा है।

source: Mary is making tea.
hi: मैरी चाय बना रही है।

source: She is making tea.
hi: वह चाय बना रही है।

source: We are making tea.
hi: हम चाय बना रहे हैं।

source: They are making tea.
hi: वे चाय बना रहे हैं।

source: French is a difficult language.
hi: फ़्रांसीसी मुश्किल भाषा है।

source: I am not Mongolian.
hi: मैं मंगोलीयाई नहीं हूँ।

source: She is not beautiful.
hi: वह सुंदर नहीं है।

source: I stopped it.
hi: मैंने रोका।

source: We heard it.
hi: हमने सुना।

source: If you help me learn English, I'll help you learn Japanese.
hi: अगर तुम ने मेरी अंग्रेज़ी सीखने में मदद की तो में तुम्हारी जापानी सीखने में मदद करूँगा।

source: We know Tom.
hi: हम टॉम को जानते हैं।

source: You helped me.
hi: तुमने मेरी मदद की।

source: You told him.
hi: आपने उनसे कहा।

source: Don't even think of going there.
hi: वहाँ भूलकर भी न जाना ।

source: As long as he stays, I will be happy.
hi: जब तक वह रहेगा तब तक मैं ख़ुश रहूँगी ।

source: I eat cucumber.
hi: मैं खीरा खाता हूँ।

source: That is my airplane.
hi: वह मेरा हवाई जहाज़ है।

source: Laurie knows how to swim.
hi: लौरी को तैरना आता है।

source: She orgasmed repeatedly.
hi: उसे बार बार कामोन्माद हुए।

source: Mary saw a mouse.
hi: मैरी ने एक चूहा देखा।

source: She is drinking tea.
hi: वह चाय पी रही है।

source: He is drinking tea.
hi: वह चाय पी रहा है।

source: We are wasting time.
hi: हम वक़्त बरबाद कर रहे हैं।

source: She respects you.
hi: वह आपका सम्मान करती है।

source: We don't have sex anymore.
hi: अभी हम सेक्स नहीं करते।

source: Is Mary your daughter?
hi: क्या मैरी तुम्हारी बेटी है?

source: Is this what Tom wants?
hi: क्या टॉम यही चाहता है?

source: That's all you get.
hi: तुम्हें उतना ही मिलेगा।

source: What's it all mean?
hi: इस सब का क्या मतलब है?

source: Who are all these people?
hi: ये सब लोग कौन हैं?

source: He knows her.
hi: वह उसे जानता है।

source: She knows her.
hi: वह उसे जानती है।

source: Mary knows her.
hi: मैरी उसे जानती है।

source: We know her.
hi: हम उसे जानते हैं।

source: What are you reading now?
hi: तुम इस समय क्या पढ़ रहे हो?

source: They convinced me.
hi: उन्होंने मुझे विश्वास दिलाया।

source: Mary has nothing.
hi: मैरी के पास कुछ नहीं है।

source: I sent one.
hi: मैंने एक भेजा।

source: I threw one.
hi: मैंने एक फेंका।

source: She sat on a chair.
hi: वह एक कुर्सी पर बैठी।

source: That's what Tom wanted.
hi: टॉम वहीं चाहता था।

source: She downloaded an antivirus.
hi: उसने एक अँटीवाइरस डाउनलोड किया।

source: She drank a glass of milk.
hi: उसने एक गिलास दूध पिया।

source: She gave an apple to Tom.
hi: उस लड़की ने टॉम को एक सेब दिया।

source: How did you get my number?
hi: तुम्हें मेरा नंबर कहाँ से मिला?

source: Go.
hi: जाओ।

source: It will be difficult, but not impossible.
hi: मुश्किल होगा, मगर ना-मुमकिन नहीं।

source: She opened a window.
hi: उसने एक खिड़की खोली।

source: That's all they wanted.
hi: वे बस उतना ही चाहते थे।

source: Some of them are clever.
hi: उनमें से कुछ होशियार हैं।

source: Africa is a very large continent.
hi: आफ़्रिका एक बहुत बड़ा महाद्वीप है।

source: How about some tea?
hi: थोड़ी सी चाय हो जाए?

source: She wants to speak.
hi: वह बोलना चाहती है।

source: Most people are idiots.
hi: ज़्यादातर लोग बेवकूफ होते हैं।

source: All trees and shrubs must be trimmed so that their branches are no closer than one metre from a power line.
hi: सभी व्रक्ष व झाड़ियाँ इस प्रकार काटी जाएं ताकि उनकी शाखाएं बिजली की तार से एक मीटर की दूरी से अधिक नज़दीक न हों |

source: Mars is the Red Planet.
hi: लाल ग्रह मंगल है।

source: Do you know who Tom is?
hi: टॉम कौन है जानते हो?

source: Everyone knows our names.
hi: हमारे नाम सब जानते हैं।

source: Hey, where did Tom go?
hi: अरे, टॉम कहाँ गया?

source: How can you forget?
hi: तुम भूल कैसे सकते हो?

source: If you were Tom, what would you want?
hi: अगर तुम टॉम होते तो तुम्हें क्या चाहिए होता?

source: It'll be done.
hi: हो जाएगा।

source: It's all in this file.
hi: सब इस फ़ाईल में है।

source: It's all we have.
hi: हमारे पास इतना ही है।

source: It's not so little.
hi: उतना भी छोटा नहीं है।

source: It's not there now.
hi: वहाँ अभी नहीं है।

source: It's the other one.
hi: दूसरा वाला है।

source: It's the same one.
hi: वही है।

source: It's time to decide.
hi: फ़ैसला लेने का वक़्त आ गया है।

source: Let these people go.
hi: इन लोगों को जाने दो।

source: No one will help us.
hi: कोई भी हमारी मदद नहीं करेगा।

source: Tell us about them.
hi: हमें उनके बारे में बताओ।

source: Tom's house was completely destroyed.
hi: टॉम का घर पूरी तरह से नष्ट हो चुका था।

source: Was Tom with you?
hi: क्या टॉम आपके साथ था?

source: Where did you get those keys?
hi: तुम्हें वे चाबियाँ कहाँ मिली?

source: Israel is a very small country.
hi: इज़राइल एक बहुत छोटा देश है।

source: "Nigger" is an offensive word.
hi: "निगर" एक अपमानजनक शब्द है।

source: "Negro" is an offensive word.
hi: "नीग्रो" एक अपमानजनक शब्द है।

source: This ink is the best.
hi: यह स्याही सबसे अच्छी है।

source: This is the best ink.
hi: यह सबसे अच्छी स्याही है।

source: This should be illegal.
hi: यह तो ग़ैरक़ानूनी होना चाहिए।

source: How much do you remember?
hi: तुम्हें कितना याद है?

source: How much time does Tom have?
hi: टॉम के पास कितना समय है?

source: Does she understand Italian?
hi: क्या उसे इतालवी समझ आती है?

source: He is a simple man.
hi: वह साधा आदमी है।

source: This book is very thin.
hi: यह किताब बहुत पतली है।

source: This road is very narrow.
hi: यह रास्ता बहुत पतला है।

source: Who is your enemy?
hi: तेरा दुश्मन कौन है ?

source: He writes beautifully.
hi: वह सुंदर लिखता है।

source: Where is your friend?
hi: तुम्हारा दोस्त कहाँ है?

source: Tom has a cow.
hi: टॉम के पास एक गाय है।

source: Love is better than sex.
hi: सेक्स से बेहतर होता है प्यार।

source: It's long been known that spoken language is the most difficult to be translated.
hi: सबको पता है कि कथित भाषा का अनुवाद करना सबसे मुश्किल है।

source: There is someone in this room.
hi: कमरे में कोई है।

source: Our country has no future.
hi: हमारे देश का कोई भविष्य नहीं है।

source: English is a language.
hi: अंग्रेज़ी एक भाषा है।

source: Tom's useless.
hi: टॉम बेकार है।

source: You'll go with me. Full stop!
hi: तुम मेरे साथ चलोगे, बात खतम!

source: He can neither hear nor see us.
hi: वह हमें ना सुन सकता है ना देख सकता है।

source: What a clever dog!
hi: क्या होशियार कुत्ता है!

source: She threatened to kill me.
hi: उसने मुझे मारने की धमकी दी है।

source: Brazil is a big country.
hi: ब्राज़ील एक बड़ा देश है।

source: Brazil is a huge country.
hi: ब्राज़ील एक विशाल देश है।

source: Antoine Lavoisier was beheaded during the French revolution.
hi: फ़्रांसीसी क्रांति के दौरान आँत्वाँ लाव्वाज़्ये का सिर काट दिया गया।

source: Are you in London?
hi: तुम लंदन में हो?

source: All of my kids want to learn French.
hi: मेरे सभी बच्चें फ़्रेंच सीखना चाहते हैं।

source: Can Tom swim?
hi: क्या टॉम तैर सकता है?

source: I'll swim with Tom tomorrow.
hi: मैं कल टॉम के साथ तैरूँगा।

source: I'm not going to quit now.
hi: मैं अभी छोड़ने वाला नहीं हूँ।

source: Is Tom able to swim?
hi: क्या टॉम तैर सकता है?

source: Is Tom swimming?
hi: क्या टॉम तैर रहा है?

source: Mary and Alice aren't sisters.
hi: मैरी और एलिस बहनें नहीं हैं।

source: Some people don't like dogs.
hi: कुछ लोगों को कुत्ते अच्छे नहीं लगते।

source: We never do that.
hi: हम वैसा कभी नहीं करते।

source: What should we do?
hi: हम क्या करें?

source: What're you two doing?
hi: तुम दोनो क्या कर रहे हो?

source: You can understand French, right?
hi: तुम्हें फ़्रांसीसी समझ आती है, ना?

source: You should be in a hospital.
hi: तुम्हें तो अस्पताल में होना चाहिए।

source: You're acting like a three-year-old.
hi: तुम किसी तीन साल के बच्चे की तरह बर्ताव कर रहे हो।

source: Tom and I used to be friends.
hi: टॉम और मैं दोस्त हुआ करते थे।

source: Tom and Mary are on their honeymoon.
hi: टॉम और मेरी अपने हनीमून पर गए हैं।

source: Tom and Mary don't talk to each other anymore.
hi: टॉम और मैरी अभी एक-दूसरे से बात नहीं करते.

source: Tom became a soldier.
hi: टॉम सैनिक बन गया।

source: Tom broke the window on purpose.
hi: टॉम ने जान-बूझकर खिड़की तोड़ी।

source: Tom doesn't have a ticket.
hi: टॉम के पास टिकट नहीं है।

source: Tom had no desire to learn French.
hi: टॉम की फ़्रांसीसी सीखने की कोई इच्छा नहीं थी।

source: Tom was swimming with us yesterday.
hi: टॉम कल हमारे साथ तैर रहा था।

source: It rained hard during the morning.
hi: सुबह भारी बारिश हुई।

source: I couldn't ask for a better holiday!
hi: सोच भी नहीं सकता था कि छुट्टी इतनी अच्छी जाएगी।

source: I don't salute their flag.
hi: मैं उनके झंडे को सलाम नहीं करता।

source: He started it!
hi: शुरुआत उसने की थी!

source: We're in Italy.
hi: हम इटली में हैं।

source: Zero, ten, one hundred, one thousand, one million, one billion.
hi: शून्य, दस, सौ, हज़ार, दस लाख, अरब।

source: Where is Tehran?
hi: तेहरान कहाँ है?

source: Tehran is in Iran.
hi: तेहरान ईरान में है।

source: Tehran is the biggest town of Iran.
hi: तेहरान ईरान का सबसे बड़ा शहर है।

source: Thank you, Einstein.
hi: धन्यवाद, आइंस्टीन.

source: The flower is red.
hi: फूल लाल है।

source: I love him, but he's gay.
hi: मैं उससे प्यार करती हूं, मगर वह गे है।

source: Gay marriage should be legal.
hi: गे विवाह वैध होना चाहिए।

source: Do you like Earl Grey tea?
hi: क्या आपको अर्ल ग्रे चाय पसंद है?

source: They say it's going to rain tonight.
hi: कहते हैं आज रात बारिश होने वाली है।

source: We bought the cheapest tea.
hi: हमने सबसे सस्ती वाली चाय खरीदी।

source: I went to Iran.
hi: मैं ईरान गया।

source: Who is in Iran?
hi: ईरान में कौन है?

source: You're from Iran.
hi: तुम ईरान के हो।

source: This animal is dangerous.
hi: यह जानवर खतरनाक होता है।

source: Next year I'm going to Hawaii.
hi: अगले साल मैं हवाई जा रहा हूँ।

source: Playing with fire is dangerous.
hi: आग से खेलना खतरनाक होता है।

source: Everyone is talking about Tom.
hi: सभी टॉम के बारे में बात कर रहे हैं।

source: Somebody's watching us.
hi: किसी की हम पर नज़र है।

source: Nobody can stop us now.
hi: अभी हमें कोई नहीं रोक सकता।

source: The book is too cheap.
hi: यह किताब कुछ ज़्यादा ही सस्ती है।

source: I did not have sex with him.
hi: मैंने उसके साथ सेक्स नहीं किया।

source: He's looking at you. Do you know him?
hi: वह तुम्हें देख रहा है। क्या तुम उसे जानते हो?

source: He's a fan of Sex and the City.
hi: वह "सेक्स एंड द सिटी" का शौकीन है।

source: I am in Russia.
hi: मैं रूस में हूँ।

source: Batman and Robin are friends.
hi: बैटमैन और रॉबिन दोस्त होते हैं।

source: We're not Bengali.
hi: हम बंगाली नहीं हैं।

source: It's not your fault.
hi: गलती तुम्हारी नहीं है।

source: The roses are red.
hi: गुलाब लाल हैं।

source: I am Iranian.
hi: मैं ईरानी हूँ।

source: Let me try again.
hi: मै फिर से कोशिश करता हूँ।

source: I'm having sex with you.
hi: मैं तुम्हारे साथ सेक्स कर रहा हूँ।

source: There are a lot of horses in my neighbourhood.
hi: मेरे मोहल्ले में बहुत सारे लोग हैं।

source: I don't get enough sleep.
hi: मेरी नींद पूरी नहीं हो पाती।

source: What's gotten into Tom?
hi: टॉम को हुआ क्या है?

source: Tom was asleep when I got home.
hi: मैं घर पहुँचा तब टॉम सोया हुआ था।

source: Tom is married, has three kids, and lives in Boston.
hi: टॉम शादीशुदा है, उसके तीन बच्चे हैं और वह बोस्टन में रहता है।

source: There's no place like Boston.
hi: बास्टन जैसी कोई जगह नहीं है।

source: I once went to Boston with Tom.
hi: मैं एक बार टॉम के साथ बॉस्टन गया था।

source: Who won the Superbowl?
hi: सुपर बोल कौन जिता?

source: He wants to kiss me. And I want to kiss him too.
hi: वह मुझे किस करना चाहता है। और मैं भी उसे किस करना चाहती हूँ।

source: What'll grow in this soil?
hi: इस मिट्टी में क्या उगेगा?

source: She knows my wife.
hi: वह मेरे बीवी को जानती है।

source: He taught his children Russian.
hi: उसने अपने बच्चों को रूसी सिखाई।

source: What did you say? I'm sorry, I was lost in thought.
hi: आपने क्या कहा? माफ़ करें, मैं सोच में डूबा था इसलिए मैंने सुना नहीं।

source: I can't forget her eyes.
hi: मैं उसकी आँखें नहीं भूल सकता।

source: They're using you.
hi: वे तुम्हारा इस्तेमाल कर रहे हैं।

source: Everybody knows that you're lying.
hi: सबको पता है कि तुम झूठ बोल रहे हो।

source: The car is black.
hi: गाड़ी काली है।

source: This is a beautiful country.
hi: यह सुंदर देश है।

source: Are you going to ask me or not?
hi: मुझसे पूछने वाले हो या नहीं?

source: And what will be the result of that?
hi: और उसका नतीजा क्या होगा?

source: Streets are not just for cars.
hi: सड़कें बस गाडियों के लिए नहीं होती।

source: This is a car and that is a bus.
hi: यह है गाड़ी और वह है बस।

source: This is a flag.
hi: यह एक झंडा है।

source: It's not that far from here.
hi: यहाँ से ज़्यादा दूर नहीं है।

source: What's WhatsApp?
hi: वाट्सऐप क्या है?

source: Facebook will buy WhatsApp for 19 billion dollars.
hi: फ़ेसबुक वॉट्सएप को १९ अरब डॉलरों में खरीद लेगा।

source: Will you teach me French?
hi: क्या तुम मुझे फ़्रांसीसी सिखाओगे?

source: Tom already did that.
hi: टॉम ने वो पहले से कर दिया हे |

source: Do you watch TV news?
hi: आप TV मे समाचार देखते है ?

source: You can't read a story if you don't understand.
hi: अगर तुम समजोगे नहीं, तो तुम वार्ता पढ़ नहीं सकते

source: They know you.
hi: वे तुम्हें जानते हैं।

source: How many languages do you know?
hi: आपको कितनी भाषाएँ आती हैं?

source: Rajinikanth is a superstar in India.
hi: रजनीकान्त भारत में सुपरस्टार है।

source: So what if I'm gay?
hi: तो क्या हुआ अगर मैं गे हूँ?

source: You're eating.
hi: तुम खा रहे हो।

source: I live in Honolulu.
hi: मैं होनोलूलू में रहता हूँ।

source: The twelve signs of the Zodiac are: Aries, Taurus, Gemini, Cancer, Leo, Virgo, Libra, Scorpio, Sagittarius, Capricorn, Aquarius and Pisces.
hi: राशिचक्र की बारह राशियाँ हैं: मेष, वृषभ, मिथुन, कर्क, सिंह, कन्या, तुला, वृश्चिक, धनु, मकर, कुम्भ और मीन।

source: The dragon saw her.
hi: ड्रैगन ने उसे देखा।

source: Jesus was a carpenter.
hi: यीशु सुतार था।

source: Tom took off his T-shirt.
hi: टॉम ने अपनी टीशर्ट उतारी।

source: Didn't you see that?
hi: तुमने देखा नहीं?

source: Hey, did you see that?
hi: अरे, वह देखा?
